/**************************************************************************/ 
/*                                                                        */ 
/*      only for 32bit mode and dosn't support interrupt nesting          */
/*                                                                        */  
/* File name:               Target.h								  */
/* Last modified Date:      2008-03-28									  */
/* Last Version:            0.01										  */
/* Descriptions:            											  */
/* QQ:                      307102293									  */
/* ENAIL:                   wodexinxiang1949@163.com                      */
/*                                                                        */
/**************************************************************************/
#ifndef __TARGET_H
#define __TARGET_H

/**************************************************************************/
/*      Hardware vector tabs                                              */ 
/**************************************************************************/

extern  void       *__GpvExceptTable[8];


/**************************************************************************/
/*      target model declear                                              */ 
/**************************************************************************/
#define MODE_USR32         0x10       	  /*  用户状态                    */
#define MODE_FIQ32         0x11           /*  快速中断状态                */
#define MODE_IRQ32         0x12           /*  中断状态                    */
#define	MODE_SVC32	       0x13           /*  管理状态                    */
#define MODE_ABT32         0x17           /*  中止状态                    */
#define MODE_UND32         0x1B           /*  未定义状态                  */
#define MODE_SYS32         0x1F           /*  系统状态                    */

#define MODE_DISFIQ        0x40           /*  关闭 FIQ 中断               */
#define MODE_DISIRQ        0x80           /*  关闭 IRQ 中断               */

/**************************************************************************/
/*      function for target                                               */ 
/**************************************************************************/
void  targetConfig(void);
void  targetInit(void);

#endif
/**************************************************************************/
/*     end of file                                                        */ 
/**************************************************************************/
